{
    "name": "Roki Roy",
    "contact": {
        "location": "Siliguri",
        "website": "https://royroki.github.io/wowfy",
        "github": "https://github.com/royroki",
        "linkedin": "https://linkedin.com/in/rokiroy",
        "email": "rokiroydev@gmail.com",
        "phone": "+91 9800 881 300"
    },
    "summary": "Full-stack developer with production experience building Flutter, React, and Golang systems used by 5,000+ users. Strong focus on clean architecture, backend performance, and shipping real-world products across web, mobile, and wearables. Proven ability to deliver and maintain production systems end-to-end in fast-paced Agile environments.",
    "experience": [
        {
            "title": "SDE 1",
            "company": "Fordel Studios",
            "location": "Onsite",
            "period": "Feb 2025 – Present",
            "url": "https://fordelstudios.com/",
            "highlights": [
                "Led end-to-end Flutter app development using clean architecture, supporting 5,000+ active users with 98% crash-free sessions",
                "Designed and implemented Golang backend services, reducing API response time by 25% and improving system reliability",
                "Collaborated with design, backend, and QA teams to architect, implement, and ship features within Agile sprints",
                "Optimized a React–Node.js e-commerce platform by integrating third-party APIs and reducing page load times by 30%",
                "Designed and shipped a companion Apple Watch app in Swift, extending core mobile functionality to wearable platforms"
            ]
        },
        {
            "title": "Full Stack Developer Intern",
            "company": "Fordel Studios",
            "location": "Onsite",
            "period": "Aug 2024 – Jan 2025",
            "url": "https://fordelstudios.com/",
            "highlights": [
                "Optimized backend APIs and database queries, improving response times and enabling new frontend features"
            ]
        }
    ],
    "projects": [
        {
            "name": "emSigner Digital Signature",
            "description": "Production Flutter application for secure digital signatures on Android and iOS, serving 5,000+ active users.",
            "url": "https://play.google.com/store/apps/details?id=com.emudhra.emSigner&hl=en_IN",
            "highlights": [
                "Developed a production Flutter application with secure API integrations and native performance, achieving 98% crash-free sessions",
                "Implemented clean architecture patterns to support scalable feature development and long-term maintainability"
            ],
            "stack": [
                "Flutter",
                "Dart",
                "REST API",
                "Android",
                "iOS"
            ]
        },
        {
            "name": "The Formula Shop - Production E-commerce Platform",
            "description": "Production e-commerce platform with live users and real order flows.",
            "url": "https://theformulashop.com/",
            "highlights": [
                "Built and shipped a production e-commerce platform with live users and real order flows",
                "Implemented product catalog, cart, and checkout flows with optimized client-side rendering",
                "Integrated third-party services for payments and order processing"
            ],
            "stack": [
                "Next.js",
                "Tailwind CSS",
                "REST APIs"
            ]
        },
        {
            "name": "Astra Terra Properties",
            "description": "Full-stack real estate platform with map-based search and advanced filtering.",
            "url": "https://www.astraterra.ae/",
            "highlights": [
                "Built a full-stack real estate platform with map-based search, advanced filtering, and optimized client-side rendering",
                "Integrated Leaflet Maps, GSAP animations, and Firebase backend for real-time data synchronization"
            ],
            "stack": [
                "Next.js",
                "TypeScript",
                "GSAP",
                "Leaflet Maps",
                "Firebase"
            ]
        },
        {
            "name": "LetsGo - Tag-Based Chat System",
            "description": "Real-time microservices chat application with tag-based user matching.",
            "url": "https://github.com/RoyRoki/LetsGo",
            "highlights": [
                "Engineered a tag-based user matching system using Redis Bitmaps and Lua scripting for low-latency user discovery",
                "Built a real-time WebSocket chat server with gRPC-based microservice communication",
                "Containerized multi-service system using Docker for scalable deployment"
            ],
            "stack": [
                "Go 1.22",
                "gRPC",
                "Redis + Lua",
                "WebSockets",
                "Docker",
                "TypeScript"
            ]
        }
    ],
    "technologies": {
        "backend": [
            "Golang",
            "PostgreSQL",
            "Docker",
            "gRPC"
        ],
        "frontend": [
            "Next.js",
            "React",
            "TypeScript",
            "JavaScript (ES6+)"
        ],
        "mobile": [
            "Flutter (Dart)",
            "Swift"
        ],
        "cloud": [
            "Firebase",
            "AWS"
        ],
        "agentic": [
            "Agentic workflows",
            "LLM tool-calling",
            "task automation",
            "AI-assisted development"
        ]
    },
    "education": [
        {
            "institution": "University of North Bengal",
            "degree": "Bachelor of Computer Applications (BCA)",
            "period": "Expected May 2027",
            "coursework": "Data Structures, Database Management Systems, Operating Systems, Computer Networks"
        }
    ]
}